sudipta26889/esp32-h2-rgb-controller/main/esp32_h2_zigbee_led.c
#include "esp32_h2_zigbee_led.h"
#include "esp_log.h"
#include "driver/ledc.h"
#include "esp_zigbee_cluster.h"
#include "esp_zigbee_core.h"

// Logging tags
static const char *TAG = "ZIGBEE_RGB_LIGHT";
static const char *TAG_ZB = "ZB_SIGNAL_HANDLER";

/**
 * Zigbee Signal Handler
 */
void esp_zb_app_signal_handler(esp_zb_app_signal_t *signal_struct) {
    if (!signal_struct) {
        ESP_LOGE(TAG_ZB, "Received NULL Zigbee signal!");
        return;
    }

    // Determine the correct field matching your Zigbee SDK version
    esp_err_t err_status = signal_struct->esp_err_status;

    ESP_LOGI(TAG_ZB, "Signal received with status: %d", err_status);

    // Replace these debugging logs with appropriate SDK field handling
    ESP_LOGI(TAG_ZB, "Dumping signal_struct fields:");
    uint8_t *raw_struct = (uint8_t *)signal_struct;
    for (size_t i = 0; i < sizeof(esp_zb_app_signal_t); i++) {
        ESP_LOGI(TAG_ZB, "Byte %zu: 0x%02X", i, raw_struct[i]);
    }

    // Example: Add the real handling switch once signal type field is identified
    // For now, integrate meaningful handling logic when fields are confirmed
}

/**
 * Initialize the Zigbee RGB Light Device
 */
void zigbee_light_init(void) {
    ESP_LOGI(TAG, "Initializing Zigbee RGB Light Device...");

    // Define default On/Off light configuration structure
    esp_zb_on_off_light_cfg_t light_cfg = ESP_ZB_DEFAULT_ON_OFF_LIGHT_CONFIG();

    // Create the Zigbee On/Off light endpoint
    esp_zb_ep_list_t *ep_list = esp_zb_on_off_light_ep_create(LIGHT_ENDPOINT, &light_cfg);
    if (ep_list == NULL) {
        ESP_LOGE(TAG, "Failed to create Zigbee endpoint.");
        return;
    }

    // Log the endpoint list to ensure it's correctly created
    ESP_LOGI(TAG, "Zigbee endpoint created: %p", ep_list);

    // Verify the integrity of the endpoint list
    if (ep_list->next == NULL) {
        ESP_LOGE(TAG, "Endpoint list is corrupted.");
        return;
    }

    // Start the Zigbee stack
    esp_err_t err = esp_zb_start(false); // Corrected API call
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start Zigbee stack (error: %d).", err);
        return;
    }

    ESP_LOGI(TAG, "Zigbee RGB Light Device initialized.");
}

/**
 * Application Main Entry Point
 */
void app_main(void) {
    ESP_LOGI("APP_MAIN", "Starting Zigbee example...");

    zigbee_light_init();   // Initialize Zigbee RGB Light
}